# NewFaceArray Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewFaceArray Method
Application Class See Also
---
Creates a new instance of a face array.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FaceArray NewFaceArray()
```

Visual Basic
---
```text
Public Function NewFaceArray As FaceArray
```

Visual C++
---
```text
public:
FaceArray^ NewFaceArray()
```

# See Also
Application Class
Autodesk.Revit.Creation Namespace